In [2]:
# Import libraries
import pandas as pd

In [14]:
# Load dataset
url = "https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv"
chipo = pd.read_csv(url, sep="\t")

In [15]:
# See first few rows
chipo.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [16]:
# Convert item price to float and remove $ sign
chipo["item_price"] = chipo["item_price"].apply(lambda x: float (x.replace("$", "")))

In [19]:
# How many products cost more than $10.00?
chipo[chipo["item_price"] > 10].shape

(1130, 5)

In [29]:
# Price of each item
price_of_items = chipo[["item_name", "item_price"]]
price_of_items.head()

                               item_name  item_price
0           Chips and Fresh Tomato Salsa        2.39
1                                   Izze        3.39
2                       Nantucket Nectar        3.39
3  Chips and Tomatillo-Green Chili Salsa        2.39
4                           Chicken Bowl       16.98

In [30]:
# Sort by name of item
price_of_items.sort_values(by="item_name")

              item_name  item_price
3389  6 Pack Soft Drink       12.98
341   6 Pack Soft Drink        6.49
1849  6 Pack Soft Drink        6.49
1860  6 Pack Soft Drink        6.49
2713  6 Pack Soft Drink        6.49
...                 ...         ...
2384  Veggie Soft Tacos        8.75
781   Veggie Soft Tacos        8.75
2851  Veggie Soft Tacos        8.49
1699  Veggie Soft Tacos       11.25
1395  Veggie Soft Tacos        8.49

[4622 rows x 2 columns]

In [45]:
# Quantity of most expensive item ordered
chipo.sort_values(by = "item_price", ascending = False).head(1)

,order_id,quantity,item_name,choice_description,item_price
3598,1443,15,Chips and Fresh Tomato Salsa,NaN,44.25

In [41]:
# How many times Veggie salad was ordered?
len(chipo[chipo["item_name"] == "Veggie Salad Bowl"])

18

In [44]:
# How many times more than one canned soda is ordered
multiple_canned_soda_order = chipo[(chipo["item_name"] == "Canned Soda") & (chipo["quantity"] > 1)] 
len(multiple_canned_soda_order)

20